Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignCode.DesignParameters Property
 Gets or sets the design parameters of the analysis design code.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObjectEnumerator DesignParameters { get; set; }
Public Property DesignParameters As AnalysisObjectEnumerator
	Get
	Set
Property Value
Type: AnalysisObjectEnumerator
See Also
Reference
AnalysisDesignCode Class
Tekla.Structures.Analysis Namespace